levizh/hc32_flashloader/HC32_CM_FL/mcu/HC32M423/hc32m423_drv.c
/*************************************************************************
 *
 *   Used with ICCARM and AARM.
 *
 *    File name   : FlashHC32.c
 *    Description : FlashLoader HC32 internal flash loader
 *
 *    History :
 *    1. Date        : May, 2017
 *       Author      : Levi Zhang
 *       Description : Initial revision
 *
 *
 *
 **************************************************************************/
//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//#include <ctype.h>
//
#include "hc32m423_drv.h"

//#include "hc32f460_reg.h"
//
//#include "flash_loader.h"       // The flash loader framework API declarations.
//#include "flash_loader_extra.h"

// Flash-specific definitions
// These encompass all the commands and status checks the program makes.
#define MULT                0x0001

/*
** definition
*/
#define TIMEOUT             (40000)             //1000 is error,10000 is ok.
                                                //set 20000

/** default settings **/

/** external functions **/

/** external data **/

/** internal functions **/



/** public data **/
/** private data **/
__no_init static volatile uint32_t flashBase;
#if USE_ARGC_ARGV
#pragma location=".flash_init_const"
const char protec_str[] = "--protect";
#pragma location=".flash_init_const"
const char cr_trim_str[] = "--cr_trim";
__no_init static volatile uint32_t protect;
__no_init static volatile uint16_t cr_trim;
__no_init static const char * cr_trim_value;
#endif

//FL_Drv_Typedef fl_drv =
//{
//    _FlashPrepare,
//    _FlashCleanup,
//    _FlashWrite,
//    _FlashEraseSector,
//    CLK_PLLInit,
//    CLK_HRCInit,
//    WDT_Process,
//};
FL_Drv_Typedef fl_drv;

/** static functions **/

void loop_wait(int lpcnt)
{
    while(lpcnt--);
}

/* CLK HRC*/
void CLK_HRCInit(void)
{
#if 0
    /* enable HRC */
    M4_CMU->HRCCR = 0;
    while(0 == bM4_CMU->OSCSTBSR_b.HRCSTBF);

    /* HRC as system clock */
    M4_CMU->CKSWR = 0U;
    /* 0 wait @ HRC */
    M4_EFM->FRMC = 0U;
    /* stop PLLH*/
    M4_CMU->PLLCR = 1U;
#endif
}

void CLK_PLLInit(void)
{
#if 0
    /* HRC = 16MHz */
    if (1UL == (*((volatile unsigned int*)(0x404UL)) & 1UL))
    {
        /*
        Fpll = clkin/m*n/p_q_r;
        M=1  (div2) -->8MHz
        N=59 (mul60)-->480MHz
        PQR=1(div2) -->240MHz
        */
        M4_CMU->PLLCFGR = (1UL<<28) | (1UL<<24) | (1UL<<20) | (59UL << 8) | (1UL << 7) | (1UL);
    }
    /* HRC = 20MHz */
    else
    {
        /*
        Fpll = clkin/m*n/p_q_r;
        M=1  (div2) -->10MHz
        N=47 (mul48)-->480MHz
        PQR=1(div2) -->240MHz
        */
        M4_CMU->PLLCFGR = (1UL<<28) | (1UL<<24) | (1UL<<20) | (47UL << 8) | (1UL << 7) | (1UL);
    }
    /* 240MHz/6 = 40MHz@0wait */
    M4_EFM->FRMC = 5U;

    /* divide SWDT/WDT clock PCLK3 */
    M4_CMU->SCFGR = (0UL << 24) | (1UL << 20) | (1UL << 16) | (3UL << 12) | (3UL << 8) |(1UL << 4) | (0UL);

    /* enable PLLH*/
    M4_CMU->PLLCFGR = 0U;
    /* PLLH as system clock */
    M4_CMU->CKSWR = 5U;

#endif
}

void SWDT_Feed(void)
{
//    M4_SWDT->RR = 0xFFFF0123ul;
//    M4_SWDT->RR = 0xFFFF3210ul;
}

void WDT_Feed(void)
{
//    M4_WDT->RR = 0xFFFF0123ul;
//    M4_WDT->RR = 0xFFFF3210ul;
}

void swdt_judge(void)
{
//    loop_wait(0x0010);
}

void wdt_judge(void)
{
//    loop_wait(0x0010);
}

void WDT_Process(void)
{
    //todo
}

/** private functions **/

uint32_t _FlashWrite(void *block_start,
                    uint32_t offset_into_block,
                    uint32_t count,
                    char const *buffer)
{
    volatile uint32_t u32To = TIMEOUT;

    uint32_t LoadAddr = (uint32_t)block_start + offset_into_block;
    flashunit * pData = (flashunit *)buffer;

    WDT_Process();

    M4_EFM->FWMC = 1UL;
    /*
    1 --> single program mode
    2 --> single program mode and read back
    3 --> continue program mode
    */
//    M4_EFM->FWMC = (0UL << 8) | (1UL<<4);

    M4_EFM->FWMC |= (1UL << 8) | (3UL<<4);
//    M4_EFM->FWMC = (0UL << 8) | 1UL;

    do
    {
        *((volatile flashunit *)LoadAddr) = *pData;

        u32To = 0UL;
        while (EFM_FSR_OPTEND != (M4_EFM->FSR & EFM_FSR_OPTEND))
//        while (EFM_FSR_RDY != (M4_EFM->FSR & EFM_FSR_RDY))
        {
            u32To++;
            if (u32To >= TIMEOUT)
            {
                WDT_Process();
                _FlashCleanup();
                return(RESULT_ERROR);
            }
        }
        M4_EFM->FSCLR |= EFM_FSCLR_OPTENDCLR;

        ++pData;
        LoadAddr += sizeof(flashunit);
        count -= sizeof(flashunit);

    } while(count >= sizeof(flashunit));

    /*
    read only mode
    */
    M4_EFM->FWMC = 1UL;
    M4_EFM->FWMC = (0UL << 8) | 0UL;

    u32To = 0UL;
    while (EFM_FSR_RDY != (M4_EFM->FSR & EFM_FSR_RDY))
    {
        u32To++;
        if (u32To >= TIMEOUT)
        {
            WDT_Process();
            _FlashCleanup();
            return(RESULT_ERROR);
        }
    }

    WDT_Process();
    return (RESULT_OK);
}

uint32_t _FlashPrepare(void)
{
    // todo for 4A0
    //WDT_Process();

    /* release write protect */
    M4_EFM->FAPRT = 0x0123U;
    M4_EFM->FAPRT = 0x3210U;

    /*
    reset cache
    prefetch off
    Dcache off
    ICache off
    insert 5 read cycles
    */
    M4_EFM->FRMC = (1<<19) | (1<<0);

    /*
    Bus hold disable? enable
    */
//    M4_EFM->FWMC = 0x00000100UL;

    M4_PWC->FPRC = 0xA501U;

    CLK_HRCInit();
    /* Set PLLH 240M as HCLK */
    //CLK_PLLInit();

    return(RESULT_OK) ;
}

void _FlashCleanup(void)
{
}

//uint32_t _FlashWriteUnit(uint32_t LoadAddr, flashunit Data)
//{
////    uint32_t u32To = TIMEOUT;
//
//    // todo
//    WDT_Process();
//
//    /*
//    1 --> single program mode
//    2 --> single program mode and read back
//    3 --> continue program mode
//    */
//    M4_EFM->FWMC = (1UL << 8) | 1UL;
//
//    *((volatile flashunit *)LoadAddr) = Data ;
//    return (RESULT_OK);
//}

uint32_t _FlashEraseSector(uint32_t SectorAddr)
{
    uint32_t u32To = 0UL;

    WDT_Process();

    /*
    4 --> page erase
    5 --> single chip erase
    6 --> dual chip erase
    */
    //M4_EFM->FWMC = (1UL << 8) |4UL;
    M4_EFM->FWMC = 1;
    M4_EFM->FWMC = (0UL << 8) | (4UL << 4);

    *((volatile flashunit *)SectorAddr ) = 0 ;

    while (EFM_FSR_RDY != (M4_EFM->FSR & EFM_FSR_RDY))
    {
        u32To++;
        if (u32To >= TIMEOUT*10UL)
        {
            WDT_Process();
            _FlashCleanup();
            return(RESULT_ERROR);
        }
    }
    /* clear opend flag, it's necessary */
    M4_EFM->FSCLR |= EFM_FSCLR_OPTENDCLR;
    /* read only mode */
    //M4_EFM->FWMC = (1UL << 8) |0UL;
    M4_EFM->FWMC = (0UL << 8) | 1UL;
    M4_EFM->FWMC = 0UL;
    return (RESULT_OK);
}
